Autodesk.Revit.DB.Architecture.BalusterPlacement.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Architecture.BalusterPlacement.BalusterPerTreadFamilyId
The id of baluster per tread family.
Remarks:
The property defines a baluster family type which is used for creation of balusters on treads.
The number of such balusters is set by "BalusterPerTreadNumber" property.
It works only for stairs which have treads and have "UseBalusterPerTreadOnStairs" set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The balusterPerTreadFamilyId doesn't refer to a valid baluster family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPlacement.BalusterPerTreadNumber
The number of balusters per tread.
Remarks:
Applicable only if UseBalusterPerTreadOnStairs is true.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for balusterPerTreadNumber is not positive.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPlacement.UseBalusterPerTreadOnStairs
If true, one or more balusters will be included on each tread of an associated stair.
If false, this is not guaranteed to happen.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPlacement.PostPattern
Accesses the object containing properties related to the post pattern.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPlacement.BalusterPattern
Accesses the object containing properties related to the baluster pattern.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPlacement
A class which contains information regarding baluster and post placement for a given railing type.
Since:
2019